// 문제 설명
// 하드디스크는 한 번에 하나의 작업만 수행할 수 있습니다. 디스크 컨트롤러를 구현하는 방법은 여러 가지가 있습니다. 가장 일반적인 방법은 요청이 들어온 순서대로 처리하는 것입니다.

// 예를들어

// - 0ms 시점에 3ms가 소요되는 A작업 요청
// - 1ms 시점에 9ms가 소요되는 B작업 요청
// - 2ms 시점에 6ms가 소요되는 C작업 요청
// 와 같은 요청이 들어왔습니다. 이를 그림으로 표현하면 아래와 같습니다.
// Screen Shot 2018-09-13 at 6.34.58 PM.png

// 한 번에 하나의 요청만을 수행할 수 있기 때문에 각각의 작업을 요청받은 순서대로 처리하면 다음과 같이 처리 됩니다.
// Screen Shot 2018-09-13 at 6.38.52 PM.png

// - A: 3ms 시점에 작업 완료 (요청에서 종료까지 : 3ms)
// - B: 1ms부터 대기하다가, 3ms 시점에 작업을 시작해서 12ms 시점에 작업 완료(요청에서 종료까지 : 11ms)
// - C: 2ms부터 대기하다가, 12ms 시점에 작업을 시작해서 18ms 시점에 작업 완료(요청에서 종료까지 : 16ms)
// 이 때 각 작업의 요청부터 종료까지 걸린 시간의 평균은 10ms(= (3 + 11 + 16) / 3)가 됩니다.

// 하지만 A → C → B 순서대로 처리하면
// Screen Shot 2018-09-13 at 6.41.42 PM.png

// - A: 3ms 시점에 작업 완료(요청에서 종료까지 : 3ms)
// - C: 2ms부터 대기하다가, 3ms 시점에 작업을 시작해서 9ms 시점에 작업 완료(요청에서 종료까지 : 7ms)
// - B: 1ms부터 대기하다가, 9ms 시점에 작업을 시작해서 18ms 시점에 작업 완료(요청에서 종료까지 : 17ms)
// 이렇게 A → C → B의 순서로 처리하면 각 작업의 요청부터 종료까지 걸린 시간의 평균은 9ms(= (3 + 7 + 17) / 3)가 됩니다.

// 각 작업에 대해 [작업이 요청되는 시점, 작업의 소요시간]을 담은 2차원 배열 jobs가 매개변수로 주어질 때, 작업의 요청부터 종료까지 걸린 시간의 평균을 가장 줄이는 방법으로 처리하면 평균이 얼마가 되는지 return 하도록 solution 함수를 작성해주세요. (단, 소수점 이하의 수는 버립니다)

// 제한 사항
// jobs의 길이는 1 이상 500 이하입니다.
// jobs의 각 행은 하나의 작업에 대한 [작업이 요청되는 시점, 작업의 소요시간] 입니다.
// 각 작업에 대해 작업이 요청되는 시간은 0 이상 1,000 이하입니다.
// 각 작업에 대해 작업의 소요시간은 1 이상 1,000 이하입니다.
// 하드디스크가 작업을 수행하고 있지 않을 때에는 먼저 요청이 들어온 작업부터 처리합니다.
// 입출력 예
// jobs	return
// [[0, 3], [1, 9], [2, 6]]	9
// 입출력 예 설명
// 문제에 주어진 예와 같습니다.

// 0ms 시점에 3ms 걸리는 작업 요청이 들어옵니다.
// 1ms 시점에 9ms 걸리는 작업 요청이 들어옵니다.
// 2ms 시점에 6ms 걸리는 작업 요청이 들어옵니다.
// 문제가 잘 안풀린다면😢
// 힌트가 필요한가요? [코딩테스트 연습 힌트 모음집]으로 오세요! → 클릭


function solution(jobs) {
    const count = jobs.length;
    const minHeap = new MinHeap();
    jobs.sort((a,b) => a[0]-b[0]);
    
    let time = 0;
    let complete = 0;
    let total = 0;
    
    while(jobs.length || minHeap.size()) {
      while(jobs.length) {
        if(jobs[0][0] === time) {
          minHeap.heappush(jobs.shift());
        } else break;
      }
      
      if(minHeap.size() && time >= complete) {
        const task = minHeap.heappop();
        complete = task[1] + time;
        total += complete - task[0];
      }
      time++;
    }
    
    return total / count >> 0;
  }
  
  class MinHeap {
      constructor() {
          this.heap = [ null ];
      }
      
      size() {
          return this.heap.length - 1;
      }
      
      getMin() {
          return this.heap[1] ? this.heap[1] : null;
      }
      
      swap(a, b) {
          [ this.heap[a], this.heap[b] ] = [ this.heap[b], this.heap[a] ];
      }
      
      heappush(value) {
          this.heap.push(value);
          let curIdx = this.heap.length - 1;
          let parIdx = (curIdx / 2) >> 0;
          
          while(curIdx > 1 && this.heap[parIdx][1] > this.heap[curIdx][1]) {
              this.swap(parIdx, curIdx)
              curIdx = parIdx;
              parIdx = (curIdx / 2) >> 0;
          }
      }
      
      heappop() {
          const min = this.heap[1];	
          if(this.heap.length <= 2) this.heap = [ null ];
          else this.heap[1] = this.heap.pop();   
          
          let curIdx = 1;
          let leftIdx = curIdx * 2;
          let rightIdx = curIdx * 2 + 1; 
          
          if(!this.heap[leftIdx]) return min;
          if(!this.heap[rightIdx]) {
              if(this.heap[leftIdx][1] < this.heap[curIdx][1]) {
                  this.swap(leftIdx, curIdx);
              }
              return min;
          }
  
          while(this.heap[leftIdx][1] < this.heap[curIdx][1] || this.heap[rightIdx][1] < this.heap[curIdx][1]) {
              const minIdx = this.heap[leftIdx][1] > this.heap[rightIdx][1] ? rightIdx : leftIdx;
              this.swap(minIdx, curIdx);
              curIdx = minIdx;
              leftIdx = curIdx * 2;
              rightIdx = curIdx * 2 + 1;
              
              if(leftIdx >= this.size()) break;
          }
  
          return min;
      }
  }